RSX-Engineering/arduino_saberprop-esp/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

menu.boardVersion=Board Version
menu.operatingSys=Operating System
menu.prop=Prop
menu.SupportedBlades=Supported blades
menu.tdeveloper=Developer Mode
menu.zdiagnoseMode=Diagnose Mode

esp32s3.name=ESP32S3 Dev Module
esp32s3.vid.0=0x303a
esp32s3.pid.0=0x1001

esp32s3.bootloader.tool=esptool_py
esp32s3.bootloader.tool.default=esptool_py

esp32s3.upload.tool=esptool_py
esp32s3.upload.tool.default=esptool_py
esp32s3.upload.tool.network=esp_ota

esp32s3.upload.maximum_size=1310720
esp32s3.upload.maximum_data_size=327680
esp32s3.upload.flags=
esp32s3.upload.extra_flags=
esp32s3.upload.use_1200bps_touch=false
esp32s3.upload.wait_for_upload_port=false

esp32s3.serial.disableDTR=false
esp32s3.serial.disableRTS=false

esp32s3.build.tarch=xtensa
esp32s3.build.bootloader_addr=0x0
esp32s3.build.target=esp32s3
esp32s3.build.mcu=esp32s3
esp32s3.build.core=esp32
esp32s3.build.variant=esp32s3
esp32s3.build.board=ESP32S3_DEV

esp32s3.build.usb_mode=1
esp32s3.build.cdc_on_boot=0
esp32s3.build.msc_on_boot=0
esp32s3.build.dfu_on_boot=0
esp32s3.build.f_cpu=240000000L
esp32s3.build.flash_size=4MB
esp32s3.build.flash_freq=80m
esp32s3.build.flash_mode=dio
esp32s3.build.boot=qio
esp32s3.build.boot_freq=80m
esp32s3.build.partitions=default
esp32s3.build.defines=
esp32s3.build.loop_core=
esp32s3.build.event_core=
esp32s3.build.psram_type=qspi
esp32s3.build.memory_type={build.boot}_{build.psram_type}


## ==== BOARD VERSION ========= ##
esp32s3.menu.boardVersion.HWVER1=UP31L
esp32s3.menu.boardVersion.HWVER1.bv.selection=U31L
esp32s3.menu.boardVersion.HWVER1.bv.audio=3
esp32s3.menu.boardVersion.HWVER1.bv.charger=1
esp32s3.menu.boardVersion.HWVER1.bv.sns=L
esp32s3.menu.boardVersion.HWVER1.bv.pwmch=4
esp32s3.menu.boardVersion.HWVER1.bv.booster=1

esp32s3.menu.boardVersion.HWVER2=UP30L
esp32s3.menu.boardVersion.HWVER2.bv.selection=U30L
esp32s3.menu.boardVersion.HWVER2.bv.audio=3
esp32s3.menu.boardVersion.HWVER2.bv.charger=0
esp32s3.menu.boardVersion.HWVER2.bv.sns=L
esp32s3.menu.boardVersion.HWVER2.bv.pwmch=4
esp32s3.menu.boardVersion.HWVER2.bv.booster=1

## === APPLICATION OPERATING SYSTEM ===== ##
#esp32s3.menu.operatingSys.pfosx=ProffieOSX
#esp32s3.menu.operatingSys.pfosx.os.selection=OSx
#esp32s3.menu.operatingSys.pfos=ProffieOS
#esp32s3.menu.operatingSys.pfos.os.selection=OSx_None

esp32s3.os.selection=OSx

## === PROP SELECTION === ##
esp32s3.menu.prop.prop1=SaberProp
esp32s3.menu.prop.prop1.pp.selection=PF_PROP_SABERPROP
esp32s3.menu.prop.prop2=UltraSaber
esp32s3.menu.prop.prop2.pp.selection=PF_PROP_ULTRASABERS
esp32s3.menu.prop.prop3=Saber
esp32s3.menu.prop.prop3.pp.selection=PF_PROP_SABER

## === SUPORTED BLADES === ##
esp32s3.menu.SupportedBlades.sbdefTwo=2 (default)
esp32s3.menu.SupportedBlades.sbdefTwo.sb.selection=2
esp32s3.menu.SupportedBlades.sbOne=1
esp32s3.menu.SupportedBlades.sbOne.sb.selection=1
esp32s3.menu.SupportedBlades.sbTwo=2
esp32s3.menu.SupportedBlades.sbTwo.sb.selection=2
esp32s3.menu.SupportedBlades.sbThree=3
esp32s3.menu.SupportedBlades.sbThree.sb.selection=3
esp32s3.menu.SupportedBlades.sbFour=4
esp32s3.menu.SupportedBlades.sbFour.sb.selection=4
esp32s3.menu.SupportedBlades.sbFive=5
esp32s3.menu.SupportedBlades.sbFive.sb.selection=5
esp32s3.menu.SupportedBlades.sbSix=6
esp32s3.menu.SupportedBlades.sbSix.sb.selection=6

## === DEVELOPER MODE === ##
esp32s3.menu.tdeveloper.devOff=Off
esp32s3.menu.tdeveloper.devOff.devMode.selection=PF_DEVELOPER_MODE_OFF
esp32s3.menu.tdeveloper.devOn=On
esp32s3.menu.tdeveloper.devOn.devMode.selection=PF_DEVELOPER_MODE_ON

## === DIAGNOSE MODE === ##
esp32s3.menu.zdiagnoseMode.statusOn=On
esp32s3.menu.zdiagnoseMode.statusOn.sp.selection=PF_STATUS_REPORT_ON
esp32s3.menu.zdiagnoseMode.statusOff=Off
esp32s3.menu.zdiagnoseMode.statusOff.sp.selection=PF_STATUS_REPORT_OFF


## IDE 2.0 Seems to not update the value
esp32s3.menu.JTAGAdapter.default=Disabled
esp32s3.menu.JTAGAdapter.default.build.copy_jtag_files=0
esp32s3.menu.JTAGAdapter.builtin=Integrated USB JTAG
esp32s3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
esp32s3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
esp32s3.menu.JTAGAdapter.external=FTDI Adapter
esp32s3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
esp32s3.menu.JTAGAdapter.external.build.copy_jtag_files=1
esp32s3.menu.JTAGAdapter.bridge=ESP USB Bridge
esp32s3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
esp32s3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

esp32s3.menu.PSRAM.disabled=Disabled
esp32s3.menu.PSRAM.disabled.build.defines=
esp32s3.menu.PSRAM.disabled.build.psram_type=qspi
esp32s3.menu.PSRAM.enabled=QSPI PSRAM
esp32s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
esp32s3.menu.PSRAM.enabled.build.psram_type=qspi
esp32s3.menu.PSRAM.opi=OPI PSRAM
esp32s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
esp32s3.menu.PSRAM.opi.build.psram_type=opi

esp32s3.menu.FlashMode.qio=QIO 80MHz
esp32s3.menu.FlashMode.qio.build.flash_mode=dio
esp32s3.menu.FlashMode.qio.build.boot=qio
esp32s3.menu.FlashMode.qio.build.boot_freq=80m
esp32s3.menu.FlashMode.qio.build.flash_freq=80m
esp32s3.menu.FlashMode.qio120=QIO 120MHz
esp32s3.menu.FlashMode.qio120.build.flash_mode=dio
esp32s3.menu.FlashMode.qio120.build.boot=qio
esp32s3.menu.FlashMode.qio120.build.boot_freq=120m
esp32s3.menu.FlashMode.qio120.build.flash_freq=80m
esp32s3.menu.FlashMode.dio=DIO 80MHz
esp32s3.menu.FlashMode.dio.build.flash_mode=dio
esp32s3.menu.FlashMode.dio.build.boot=dio
esp32s3.menu.FlashMode.dio.build.boot_freq=80m
esp32s3.menu.FlashMode.dio.build.flash_freq=80m
esp32s3.menu.FlashMode.opi=OPI 80MHz
esp32s3.menu.FlashMode.opi.build.flash_mode=dout
esp32s3.menu.FlashMode.opi.build.boot=opi
esp32s3.menu.FlashMode.opi.build.boot_freq=80m
esp32s3.menu.FlashMode.opi.build.flash_freq=80m

