RSX-Engineering/arduino_saberprop-esp/boards.txt
esp32s3.build.extra_flags= -DPROFFIE_ESP -DBOARD_HAS_PSRAM -DHWVER='{bv.selection}' -D{os.selection} -D{devMode.selection} -D{sp.selection} -D{pp.selection} -DHW_NUM_BLADES={sb.selection} -DHW_NUM_BUTTONS=2 -DHW_PREFIX=U -DHW_LETTER1={bv.audio} -DHW_LETTER2={bv.charger} -DHW_LETTER3={bv.sns} -DHW_LETTER4={bv.pwmch} -DHW_LETTER5={bv.booster}

##############################################################

##############################################################
##### ULTRA ProFFIE ESP BOARD CONFIGUrATiON         ##########
##############################################################


menu.boardVersion=Board Version
menu.operatingSys=Operating System
menu.prop=Prop
menu.SupportedBlades=Supported blades
menu.tdeveloper=Developer Mode
menu.zdiagnoseMode=Diagnose Mode

SaberProp-esp32s3.name=SaberProp
SaberProp-esp32s3.vid.0=0x303a
SaberProp-esp32s3.pid.0=0x1001

SaberProp-esp32s3.bootloader.tool=esptool_py
SaberProp-esp32s3.bootloader.tool.default=esptool_py

SaberProp-esp32s3.upload.tool=esptool_py
SaberProp-esp32s3.upload.tool.default=esptool_py
SaberProp-esp32s3.upload.tool.network=esp_ota

SaberProp-esp32s3.upload.maximum_size=1310720
SaberProp-esp32s3.upload.maximum_data_size=327680
SaberProp-esp32s3.upload.flags=
SaberProp-esp32s3.upload.extra_flags=
SaberProp-esp32s3.upload.use_1200bps_touch=false
SaberProp-esp32s3.upload.wait_for_upload_port=false

SaberProp-esp32s3.serial.disableDTR=false
SaberProp-esp32s3.serial.disableRTS=false

SaberProp-esp32s3.build.tarch=xtensa
SaberProp-esp32s3.build.bootloader_addr=0x0
SaberProp-esp32s3.build.target=esp32s3
SaberProp-esp32s3.build.mcu=esp32s3
SaberProp-esp32s3.build.core=esp32
SaberProp-esp32s3.build.variant=esp32s3
SaberProp-esp32s3.build.board=ESP32S3_DEV

SaberProp-esp32s3.build.usb_mode=0
SaberProp-esp32s3.build.cdc_on_boot=0
SaberProp-esp32s3.build.msc_on_boot=0
SaberProp-esp32s3.build.dfu_on_boot=0
SaberProp-esp32s3.build.f_cpu=240000000L
SaberProp-esp32s3.build.flash_size=8MB
SaberProp-esp32s3.build.flash_freq=80m
SaberProp-esp32s3.build.flash_mode=dio
SaberProp-esp32s3.build.boot=qio
SaberProp-esp32s3.build.boot_freq=80m
SaberProp-esp32s3.build.partitions=default_8mb
SaberProp-esp32s3.build.defines=
SaberProp-esp32s3.build.loop_core=
SaberProp-esp32s3.build.event_core=
SaberProp-esp32s3.build.psram_type=qspi
SaberProp-esp32s3.build.memory_type={build.boot}_{build.psram_type}


## ==== BOARD VERSION ========= ##
SaberProp-esp32s3.menu.boardVersion.HWVER1=UP31L
SaberProp-esp32s3.menu.boardVersion.HWVER1.bv.selection=U31L
SaberProp-esp32s3.menu.boardVersion.HWVER1.bv.audio=3
SaberProp-esp32s3.menu.boardVersion.HWVER1.bv.charger=1
SaberProp-esp32s3.menu.boardVersion.HWVER1.bv.sns=L
SaberProp-esp32s3.menu.boardVersion.HWVER1.bv.pwmch=4
SaberProp-esp32s3.menu.boardVersion.HWVER1.bv.booster=1

SaberProp-esp32s3.menu.boardVersion.HWVER2=UP30L
SaberProp-esp32s3.menu.boardVersion.HWVER2.bv.selection=U30L
SaberProp-esp32s3.menu.boardVersion.HWVER2.bv.audio=3
SaberProp-esp32s3.menu.boardVersion.HWVER2.bv.charger=0
SaberProp-esp32s3.menu.boardVersion.HWVER2.bv.sns=L
SaberProp-esp32s3.menu.boardVersion.HWVER2.bv.pwmch=4
SaberProp-esp32s3.menu.boardVersion.HWVER2.bv.booster=1

## === APPLICATION OPERATING SYSTEM ===== ##
#SaberProp-esp32s3.menu.operatingSys.pfosx=ProffieOSX
#SaberProp-esp32s3.menu.operatingSys.pfosx.os.selection=OSx
#SaberProp-esp32s3.menu.operatingSys.pfos=ProffieOS
#SaberProp-esp32s3.menu.operatingSys.pfos.os.selection=OSx_None
SaberProp-esp32s3.os.selection=OSx
## === PROP SELECTION === ##
SaberProp-esp32s3.menu.prop.prop1=SaberProp
SaberProp-esp32s3.menu.prop.prop1.pp.selection=PF_PROP_SABERPROP
SaberProp-esp32s3.menu.prop.prop2=UltraSaber
SaberProp-esp32s3.menu.prop.prop2.pp.selection=PF_PROP_ULTRASABERS
SaberProp-esp32s3.menu.prop.prop3=Saber
SaberProp-esp32s3.menu.prop.prop3.pp.selection=PF_PROP_SABER


## === SUPORTED BLADES === ##
SaberProp-esp32s3.menu.SupportedBlades.sbdefTwo=2 (default)
SaberProp-esp32s3.menu.SupportedBlades.sbdefTwo.sb.selection=2
SaberProp-esp32s3.menu.SupportedBlades.sbOne=1
SaberProp-esp32s3.menu.SupportedBlades.sbOne.sb.selection=1
SaberProp-esp32s3.menu.SupportedBlades.sbTwo=2
SaberProp-esp32s3.menu.SupportedBlades.sbTwo.sb.selection=2
SaberProp-esp32s3.menu.SupportedBlades.sbThree=3
SaberProp-esp32s3.menu.SupportedBlades.sbThree.sb.selection=3
SaberProp-esp32s3.menu.SupportedBlades.sbFour=4
SaberProp-esp32s3.menu.SupportedBlades.sbFour.sb.selection=4
SaberProp-esp32s3.menu.SupportedBlades.sbFive=5
SaberProp-esp32s3.menu.SupportedBlades.sbFive.sb.selection=5
SaberProp-esp32s3.menu.SupportedBlades.sbSix=6
SaberProp-esp32s3.menu.SupportedBlades.sbSix.sb.selection=6

## === DEVELOPER MODE === ##
SaberProp-esp32s3.menu.tdeveloper.devOff=Off
SaberProp-esp32s3.menu.tdeveloper.devOff.devMode.selection=PF_DEVELOPER_MODE_OFF
SaberProp-esp32s3.menu.tdeveloper.devOn=On
SaberProp-esp32s3.menu.tdeveloper.devOn.devMode.selection=PF_DEVELOPER_MODE_ON

## === DIAGNOSE MODE === ##
SaberProp-esp32s3.menu.zdiagnoseMode.statusOn=On
SaberProp-esp32s3.menu.zdiagnoseMode.statusOn.sp.selection=PF_STATUS_REPORT_ON
SaberProp-esp32s3.menu.zdiagnoseMode.statusOff=Off
SaberProp-esp32s3.menu.zdiagnoseMode.statusOff.sp.selection=PF_STATUS_REPORT_OFF


## IDE 2.0 Seems to not update the value
SaberProp-esp32s3.default.build.copy_jtag_files=0


SaberProp-esp32s3.build.defines=-DBOARD_HAS_PSRAM
SaberProp-esp32s3.build.psram_type=qspi


SaberProp-esp32s3.build.flash_mode=dio
SaberProp-esp32s3.build.boot=qio
SaberProp-esp32s3.build.boot_freq=80m
SaberProp-esp32s3.build.flash_freq=80m


SaberProp-esp32s3.build.flash_size=8MB
SaberProp-esp32s3.build.partitions=default_8MB

SaberProp-esp32s3.build.loop_core=-DARDUINO_RUNNING_CORE=1
SaberProp-esp32s3.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1



SaberProp-esp32s3.build.partitions=default_8MB
SaberProp-esp32s3.upload.maximum_size=3342336

SaberProp-esp32s3.build.f_cpu=240000000L

SaberProp-esp32s3.upload.speed=921600

SaberProp-esp32s3.menu.DebugLevel.none=None
SaberProp-esp32s3.menu.DebugLevel.none.build.code_debug=0
SaberProp-esp32s3.menu.DebugLevel.error=Error
SaberProp-esp32s3.menu.DebugLevel.error.build.code_debug=1
SaberProp-esp32s3.menu.DebugLevel.warn=Warn
SaberProp-esp32s3.menu.DebugLevel.warn.build.code_debug=2
SaberProp-esp32s3.menu.DebugLevel.info=Info
SaberProp-esp32s3.menu.DebugLevel.info.build.code_debug=3
SaberProp-esp32s3.menu.DebugLevel.debug=Debug
SaberProp-esp32s3.menu.DebugLevel.debug.build.code_debug=4
SaberProp-esp32s3.menu.DebugLevel.verbose=Verbose
SaberProp-esp32s3.menu.DebugLevel.verbose.build.code_debug=5


SaberProp-esp32s3.upload.erase_cmd=-e

SaberProp-esp32s3.build.extra_flags= -DPROFFIE_ESP -DBOARD_HAS_PSRAM -DESP_S3_WROOM -DHWVER='{bv.selection}' -D{os.selection} -D{devMode.selection} -D{sp.selection} -D{pp.selection} -DHW_NUM_BLADES={sb.selection} -DHW_NUM_BUTTONS=2 -DHW_PREFIX=U -DHW_LETTER1={bv.audio} -DHW_LETTER2={bv.charger} -DHW_LETTER3={bv.sns} -DHW_LETTER4={bv.pwmch} -DHW_LETTER5={bv.booster}
